OdDAI.CompressedGUID.op_Implicit~System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*
\details
Converts the Compressed GUID object's value to a C++ character array.
\returns A raw pointer to the C++ character array.